{
  "Genesis": {
    "1": {
      "1": {
        "commentary": "The opening verse of Scripture establishes the fundamental truth of creation ex nihilo (out of nothing). The Hebrew word 'Elohim' (God) is plural in form but singular in meaning, hinting at the Trinity.",
        "cross_references": ["John 1:1-3", "Colossians 1:16", "Hebrews 11:3"],
        "theological_notes": [
          "Creation vs. Evolution: This verse directly contradicts evolutionary theory by asserting divine creation.",
          "The Trinity: The plural 'Elohim' with singular verb suggests the triune nature of God."
        ],
        "hebrew_insights": {
          "bara": "To create from nothing - used only of divine activity",
          "elohim": "Plural form of majesty indicating the fullness of deity"
        }
      },
      "2": {
        "commentary": "The condition described here is not the original creation, but rather the result of divine judgment. The earth became 'without form and void' - a phrase indicating desolation and judgment.",
        "cross_references": ["Isaiah 45:18", "Jeremiah 4:23", "2 Peter 3:5-6"],
        "theological_notes": [
          "Gap Theory: Some scholars propose a gap between verses 1 and 2, allowing for a pre-Adamic world.",
          "Divine Judgment: The Hebrew 'tohu wa-bohu' suggests chaos resulting from judgment."
        ]
      },
      "3": {
        "commentary": "The first recorded words of God introduce light as His initial creative act. Light precedes the creation of luminaries, indicating that God Himself is the source of all light.",
        "cross_references": ["John 1:5", "1 John 1:5", "2 Corinthians 4:6"],
        "theological_notes": [
          "Christ as Light: This primordial light prefigures Christ, the true Light of the world.",
          "Divine Speech: God's word is creative power - 'He spake, and it was done.'"
        ]
      },
      "26": {
        "commentary": "The plural pronoun 'Us' reveals the Trinity in consultation concerning man's creation. Man is created in God's image, possessing intellect, emotion, and will - the constituents of personality.",
        "cross_references": ["Genesis 3:22", "Genesis 11:7", "Colossians 3:10"],
        "theological_notes": [
          "Image of God: Man alone bears the divine image, setting him apart from all creation.",
          "Trinity in Creation: The plural 'Us' indicates the participation of all three Persons."
        ],
        "practical_application": "Understanding our creation in God's image establishes human dignity and our capacity for fellowship with God."
      },
      "27": {
        "commentary": "The repetition emphasizes the unique nature of man's creation. Both male and female bear God's image equally, though their roles may differ.",
        "cross_references": ["Matthew 19:4", "Mark 10:6", "Galatians 3:28"],
        "theological_notes": [
          "Gender Equality: Both sexes equally bear the divine image.",
          "Marriage Foundation: The binary nature of human sexuality is established here."
        ]
      }
    },
    "2": {
      "7": {
        "commentary": "Man's unique formation from the dust distinguishes him from other creatures. The 'breath of life' imparts the divine spark, making man a living soul with eternal significance.",
        "cross_references": ["1 Corinthians 15:45", "Job 33:4", "Ecclesiastes 12:7"],
        "theological_notes": [
          "Trichotomy: Man consists of body (dust), soul (breath), and spirit.",
          "Divine Intimacy: God personally forms man, showing special care and purpose."
        ]
      },
      "15": {
        "commentary": "Man's placement in Eden establishes the principle of stewardship. Work is ordained by God and is not a result of the Fall, but a divine calling.",
        "cross_references": ["Genesis 1:28", "Ephesians 2:10", "2 Thessalonians 3:10"],
        "theological_notes": [
          "Divine Calling: Work is part of God's original design for humanity.",
          "Environmental Stewardship: Man is caretaker, not owner, of creation."
        ]
      },
      "17": {
        "commentary": "The first divine prohibition introduces the principle of moral law. Death enters as the consequence of disobedience, establishing the wages of sin.",
        "cross_references": ["Romans 6:23", "James 1:15", "Ezekiel 18:4"],
        "theological_notes": [
          "Moral Law: God's commands establish the standard of righteousness.",
          "Death as Penalty: Spiritual and physical death result from sin."
        ]
      }
    },
    "3": {
      "1": {
        "commentary": "Satan's first appearance in Scripture reveals his character as the deceiver. His question 'Hath God said?' introduces doubt concerning God's Word - the foundation of all temptation.",
        "cross_references": ["2 Corinthians 11:3", "Revelation 12:9", "John 8:44"],
        "theological_notes": [
          "Satanic Strategy: Questioning God's Word is Satan's primary tactic.",
          "The Serpent: Satan uses the most subtle creature for his first temptation."
        ]
      },
      "6": {
        "commentary": "The threefold temptation (lust of the flesh, lust of the eyes, pride of life) becomes the pattern for all subsequent temptation, including Christ's temptation in the wilderness.",
        "cross_references": ["1 John 2:16", "Matthew 4:1-11", "James 1:14"],
        "theological_notes": [
          "Triple Temptation: The same pattern used against Christ in Matthew 4.",
          "Human Nature: These three areas encompass all human vulnerability to sin."
        ]
      },
      "15": {
        "commentary": "The Protoevangelium - the first gospel promise. The 'seed of the woman' refers to Christ's virgin birth and His ultimate victory over Satan at Calvary.",
        "cross_references": ["Galatians 4:4", "Revelation 12:1-5", "Romans 16:20"],
        "theological_notes": [
          "First Messianic Promise: Christ's victory over Satan is prophesied.",
          "Virgin Birth: 'Seed of woman' suggests miraculous conception.",
          "Satan's Defeat: The serpent's head wound indicates total defeat."
        ],
        "prophetic_significance": "This verse contains the first promise of redemption, pointing forward to Christ's atoning work."
      }
    },
    "12": {
      "1": {
        "commentary": "God's call to Abraham marks the beginning of His redemptive program through a chosen people. The command involves separation from country, kindred, and father's house.",
        "cross_references": ["Hebrews 11:8", "Acts 7:2-3", "Isaiah 51:2"],
        "theological_notes": [
          "Divine Election: God sovereignly chooses Abraham for His purposes.",
          "Faith Response: Abraham's obedience demonstrates saving faith.",
          "Separation Principle: God's people must separate from worldly entanglements."
        ]
      },
      "2-3": {
        "commentary": "The Abrahamic Covenant contains seven specific promises, forming the foundation for all subsequent covenants. This covenant is unconditional and eternal.",
        "cross_references": ["Genesis 15:18", "Genesis 17:7", "Galatians 3:16-17"],
        "theological_notes": [
          "Unconditional Covenant: God's promises depend on His faithfulness, not Abraham's.",
          "Seven Promises: Great nation, blessing, great name, blessing to others, protection, universal blessing through his seed.",
          "Messianic Line: The promise of blessing 'in thee' points to Christ."
        ],
        "covenant_elements": {
          "personal": "I will make of thee a great nation",
          "national": "I will bless thee and make thy name great",
          "universal": "In thee shall all families of the earth be blessed"
        }
      }
    }
  },
  "Exodus": {
    "3": {
      "14": {
        "commentary": "God's revelation of His name 'I AM THAT I AM' (Yahweh) reveals His self-existence and eternality. This name becomes the covenant name by which God relates to Israel.",
        "cross_references": ["John 8:58", "Revelation 1:8", "Exodus 6:3"],
        "theological_notes": [
          "Divine Self-Existence: God exists by the necessity of His own nature.",
          "Covenant Name: Yahweh becomes God's special name for His people.",
          "Christ's Claim: Jesus applies this name to Himself in John 8:58."
        ],
        "hebrew_insights": {
          "ehyeh": "I AM - expressing absolute being and self-existence",
          "yahweh": "The covenant name derived from this revelation"
        }
      }
    },
    "12": {
      "13": {
        "commentary": "The blood of the Passover lamb provides the type of Christ's atoning sacrifice. The blood must be applied to be effective - faith must appropriate Christ's work.",
        "cross_references": ["1 Corinthians 5:7", "1 Peter 1:19", "Hebrews 9:22"],
        "theological_notes": [
          "Substitutionary Atonement: The lamb dies in place of the firstborn.",
          "Applied Blood: The blood must be personally applied by faith.",
          "Christ Our Passover: The lamb typifies Christ's sacrificial death."
        ],
        "typological_significance": "The Passover lamb is one of the clearest Old Testament types of Christ's atoning sacrifice."
      }
    },
    "20": {
      "3": {
        "commentary": "The first commandment establishes monotheism as fundamental to true religion. 'Before me' means 'in my presence' - God tolerates no rivals.",
        "cross_references": ["Deuteronomy 6:4", "1 Corinthians 8:6", "Isaiah 45:5"],
        "theological_notes": [
          "Monotheism: The foundation of biblical faith is belief in one true God.",
          "Exclusive Worship: God demands undivided allegiance.",
          "Spiritual Adultery: Idolatry is portrayed as unfaithfulness in marriage."
        ]
      }
    }
  },
  "Deuteronomy": {
    "6": {
      "4": {
        "commentary": "The Shema declares the fundamental doctrine of monotheism. 'Hear' implies obedient attention, not mere listening. This confession became central to Jewish faith.",
        "cross_references": ["Mark 12:29", "1 Corinthians 8:6", "Ephesians 4:6"],
        "theological_notes": [
          "Unity of God: Despite plural names, God is absolutely one in essence.",
          "Covenant Basis: This confession forms the foundation of Israel's covenant relationship.",
          "Jesus' Affirmation: Christ quotes this as the greatest commandment."
        ]
      }
    },
    "18": {
      "15": {
        "commentary": "The promise of a Prophet like Moses finds its ultimate fulfillment in Christ. This Prophet would mediate between God and man as Moses did.",
        "cross_references": ["Acts 3:22", "Acts 7:37", "John 1:21"],
        "theological_notes": [
          "Messianic Prophecy: This Prophet is the Messiah who mediates the New Covenant.",
          "Like Moses: As Moses mediated the Old Covenant, Christ mediates the New.",
          "Divine Authority: This Prophet speaks God's words with absolute authority."
        ]
      }
    }
  },
  "Psalms": {
    "2": {
      "7": {
        "commentary": "This decree establishes the eternal Sonship of Christ and His right to rule. 'This day' refers to the eternal relationship within the Trinity.",
        "cross_references": ["Hebrews 1:5", "Acts 13:33", "Matthew 3:17"],
        "theological_notes": [
          "Eternal Sonship: Christ's Sonship is eternal, not adoptive.",
          "Messianic Kingdom: The Son has the right to rule over all nations.",
          "Trinity: The Father-Son relationship within the Godhead is revealed."
        ]
      }
    },
    "22": {
      "1": {
        "commentary": "David's cry of abandonment prophetically voices Christ's experience on the cross. This psalm contains remarkable details of crucifixion centuries before it was practiced.",
        "cross_references": ["Matthew 27:46", "Mark 15:34", "Hebrews 5:7"],
        "theological_notes": [
          "Prophetic Crucifixion: Details of Christ's death are predicted with startling accuracy.",
          "Divine Abandonment: Christ experienced separation from the Father for our sins.",
          "Substitutionary Suffering: Christ bore the punishment we deserved."
        ]
      }
    },
    "23": {
      "1": {
        "commentary": "The Lord as Shepherd establishes one of Scripture's most beloved metaphors. The personal 'my' indicates individual relationship with God.",
        "cross_references": ["John 10:11", "Hebrews 13:20", "1 Peter 5:4"],
        "theological_notes": [
          "Personal Relationship: 'My Shepherd' indicates intimate, individual care.",
          "Divine Provision: A true shepherd provides everything needed for the flock.",
          "Christ the Shepherd: Jesus applies this metaphor to Himself in John 10."
        ]
      }
    },
    "110": {
      "1": {
        "commentary": "The most quoted Old Testament verse in the New Testament establishes Christ's deity and His session at the Father's right hand following His ascension.",
        "cross_references": ["Matthew 22:44", "Hebrews 1:13", "Acts 2:34"],
        "theological_notes": [
          "Christ's Deity: The Father addresses the Son as 'Lord'.",
          "Heavenly Session: Christ now sits at God's right hand as our High Priest.",
          "Coming Victory: All enemies will ultimately be subdued."
        ]
      }
    }
  },
  "Isaiah": {
    "7": {
      "14": {
        "commentary": "The sign of Immanuel ('God with us') receives its ultimate fulfillment in Christ's virgin birth. The Hebrew 'almah' indicates a young woman of marriageable age.",
        "cross_references": ["Matthew 1:23", "Luke 1:31", "Isaiah 9:6"],
        "theological_notes": [
          "Virgin Birth: The sign requires miraculous conception.",
          "Incarnation: God becomes man while remaining fully God.",
          "Immanuel: Christ is literally 'God with us' in human flesh."
        ]
      }
    },
    "9": {
      "6": {
        "commentary": "This great Messianic prophecy declares both the humanity ('child born') and deity ('God given') of the coming Messiah. His government will be eternal.",
        "cross_references": ["John 1:14", "Titus 2:13", "Luke 1:32"],
        "theological_notes": [
          "Dual Nature: Christ is both human (born) and divine (given).",
          "Four Names: Each title reveals an aspect of Messiah's character and work.",
          "Eternal Kingdom: His government will have no end."
        ]
      }
    },
    "53": {
      "5": {
        "commentary": "The heart of the gospel is contained in this verse. Christ's vicarious suffering accomplishes our healing and peace with God.",
        "cross_references": ["1 Peter 2:24", "2 Corinthians 5:21", "Romans 4:25"],
        "theological_notes": [
          "Substitutionary Atonement: Christ bears our punishment in our place.",
          "Vicarious Suffering: His wounds heal our spiritual diseases.",
          "Peace with God: His sacrifice reconciles us to the Father."
        ]
      }
    }
  },
  "Daniel": {
    "9": {
      "24-27": {
        "commentary": "The prophecy of seventy weeks provides the chronological framework for Messiah's first coming and the tribulation period preceding His second coming.",
        "cross_references": ["Matthew 24:15", "Revelation 11:2", "Luke 19:42"],
        "theological_notes": [
          "Prophetic Timeline: The weeks are 'weeks of years' totaling 490 years.",
          "Messiah's Death: The cutting off of Messiah occurs after 69 weeks.",
          "Future Tribulation: The final week awaits future fulfillment."
        ],
        "prophetic_structure": {
          "seven_weeks": "49 years - rebuilding of Jerusalem",
          "sixty_two_weeks": "434 years - until Messiah's coming",
          "final_week": "7 years - future tribulation period"
        }
      }
    }
  },
  "Matthew": {
    "1": {
      "23": {
        "commentary": "Matthew demonstrates that Jesus fulfills Isaiah's prophecy of Immanuel. The virgin birth is essential to Christ's sinless nature and divine-human person.",
        "cross_references": ["Isaiah 7:14", "Luke 1:35", "Galatians 4:4"],
        "theological_notes": [
          "Prophetic Fulfillment: Jesus literally fulfills Isaiah's prophecy.",
          "Virgin Birth: Essential for Christ's sinless nature.",
          "Incarnation: God becomes man without ceasing to be God."
        ]
      }
    },
    "5": {
      "3": {
        "commentary": "The first beatitude introduces the character of kingdom citizens. 'Poor in spirit' describes those who recognize their spiritual bankruptcy apart from God.",
        "cross_references": ["Luke 6:20", "Isaiah 57:15", "Isaiah 66:2"],
        "theological_notes": [
          "Spiritual Poverty: Recognition of one's need for God's grace.",
          "Kingdom Citizens: These describe the character of those in God's kingdom.",
          "Divine Blessing: God's favor rests on the humble in spirit."
        ]
      }
    },
    "16": {
      "16": {
        "commentary": "Peter's great confession acknowledges both Christ's Messiahship and His deity. This confession forms the foundation upon which the church is built.",
        "cross_references": ["John 6:69", "Matthew 14:33", "John 20:28"],
        "theological_notes": [
          "Divine Revelation: This truth is revealed by the Father, not human wisdom.",
          "Church Foundation: The church is built on the truth of Christ's deity.",
          "Messianic Recognition: Jesus is both Christ (Messiah) and Son of God."
        ]
      }
    },
    "28": {
      "19": {
        "commentary": "The Great Commission commands the church to make disciples of all nations. Baptism 'in the name' (singular) of the Trinity reveals the unity of the Godhead.",
        "cross_references": ["Acts 1:8", "Mark 16:15", "2 Corinthians 13:14"],
        "theological_notes": [
          "Universal Mission: The gospel is for all nations, not just Jews.",
          "Trinity: One name for three Persons reveals the unity of God.",
          "Church's Task: Making disciples, not just converts, is the goal."
        ]
      }
    }
  },
  "John": {
    "1": {
      "1": {
        "commentary": "The prologue establishes Christ's eternal deity. The Word (Logos) was not created but existed eternally with God as God. This refutes all forms of Arianism.",
        "cross_references": ["Colossians 1:15-17", "Hebrews 1:3", "Revelation 19:13"],
        "theological_notes": [
          "Eternal Existence: The Word had no beginning but existed eternally.",
          "Distinct Person: The Word was 'with God' - a distinct Person in the Trinity.",
          "True Deity: The Word 'was God' - possessing full divine nature."
        ]
      },
      "14": {
        "commentary": "The incarnation - God becomes flesh while remaining fully God. 'Dwelt' (literally 'tabernacled') recalls God's presence in the wilderness tabernacle.",
        "cross_references": ["1 Timothy 3:16", "Philippians 2:6-7", "Hebrews 2:14"],
        "theological_notes": [
          "Incarnation: God assumes human nature without losing divine nature.",
          "Tabernacle Imagery: Christ is the true meeting place between God and man.",
          "Divine Glory: His glory is seen by those with spiritual sight."
        ]
      }
    },
    "3": {
      "16": {
        "commentary": "The gospel in miniature declares God's love, the gift of His Son, and the condition of faith for eternal life. This verse encapsulates the entire plan of salvation.",
        "cross_references": ["Romans 5:8", "1 John 4:9", "Ephesians 2:8-9"],
        "theological_notes": [
          "God's Love: The motive for salvation is divine love, not human merit.",
          "Substitutionary Gift: God gives His only Son as our substitute.",
          "Faith Alone: Believing (trust) is the sole condition for salvation."
        ]
      }
    },
    "14": {
      "6": {
        "commentary": "Christ's exclusive claim eliminates all religious pluralism. He is not merely a way to God, but THE way - the only means of salvation.",
        "cross_references": ["Acts 4:12", "1 Timothy 2:5", "John 10:9"],
        "theological_notes": [
          "Exclusive Salvation: Christ is the only way to the Father.",
          "Three-fold Claim: Way (method), Truth (revelation), Life (power).",
          "Religious Pluralism Refuted: No other religion leads to God."
        ]
      }
    }
  },
  "Romans": {
    "1": {
      "16": {
        "commentary": "Paul declares the gospel as God's power for salvation. The order 'Jew first, then Gentile' reflects God's historical program of redemption.",
        "cross_references": ["1 Corinthians 1:18", "Romans 2:9-10", "Acts 13:46"],
        "theological_notes": [
          "Divine Power: The gospel contains inherent power to save.",
          "Universal Offer: Salvation is available to all who believe.",
          "Historical Priority: Jews received the first offer of the gospel."
        ]
      },
      "17": {
        "commentary": "The righteousness of God refers to a righteousness from God, imputed to believers by faith. This is the central theme of Romans.",
        "cross_references": ["Philippians 3:9", "2 Corinthians 5:21", "Habakkuk 2:4"],
        "theological_notes": [
          "Imputed Righteousness: God credits Christ's righteousness to believers.",
          "Faith Alone: This righteousness is received by faith, not works.",
          "Progressive Revelation: From faith (initial) to faith (continued)."
        ]
      }
    },
    "3": {
      "23": {
        "commentary": "Universal sinfulness levels all humanity before God. No one can claim righteousness based on comparative morality or religious works.",
        "cross_references": ["Ecclesiastes 7:20", "1 John 1:8", "Galatians 3:22"],
        "theological_notes": [
          "Universal Condemnation: All humans are sinners without exception.",
          "Divine Standard: God's glory is the standard we all fail to meet.",
          "Need for Salvation: Human sinfulness necessitates divine intervention."
        ]
      }
    },
    "5": {
      "8": {
        "commentary": "God's love is demonstrated not by our worthiness, but by Christ's death for unworthy sinners. This love is undeserved and unconditional.",
        "cross_references": ["1 John 4:10", "Ephesians 2:4-5", "Titus 3:4-5"],
        "theological_notes": [
          "Unmerited Love: God loves us despite our sinfulness.",
          "Demonstration: Christ's death is the proof of God's love.",
          "Divine Initiative: God loved us first, before any response from us."
        ]
      }
    },
    "8": {
      "28": {
        "commentary": "Divine sovereignty works all circumstances for the ultimate good of believers. This 'good' refers to conformity to Christ's image, not necessarily temporal comfort.",
        "cross_references": ["Ephesians 1:11", "Romans 8:29", "Genesis 50:20"],
        "theological_notes": [
          "Divine Sovereignty: God controls all circumstances for His purposes.",
          "Ultimate Good: Spiritual good, not necessarily temporal prosperity.",
          "Called According to Purpose: This promise applies to genuine believers."
        ]
      }
    }
  },
  "1_Corinthians": {
    "15": {
      "3-4": {
        "commentary": "Paul summarizes the essential elements of the gospel: Christ's death for sins, His burial (proving His death), and His resurrection (proving His victory).",
        "cross_references": ["Isaiah 53:5", "Psalm 16:10", "1 Peter 3:18"],
        "theological_notes": [
          "Gospel Essentials: Death, burial, and resurrection are non-negotiable.",
          "Substitutionary Atonement: Christ died 'for our sins' as our substitute.",
          "Scriptural Fulfillment: All events fulfill Old Testament prophecy."
        ]
      }
    }
  },
  "Ephesians": {
    "2": {
      "8-9": {
        "commentary": "Salvation by grace through faith excludes all human works as a contributing cause. Grace is God's unmerited favor; faith is the empty hand that receives it.",
        "cross_references": ["Romans 3:28", "Titus 3:5", "Romans 4:4-5"],
        "theological_notes": [
          "Grace Alone: Salvation originates entirely from God's grace.",
          "Faith Alone: Faith is the instrument, not the ground, of salvation.",
          "Works Excluded: Human effort contributes nothing to salvation."
        ]
      }
    }
  },
  "Philippians": {
    "2": {
      "6-7": {
        "commentary": "The kenosis - Christ's self-emptying in the incarnation. He did not cease to be God but took on human nature, veiling His divine glory.",
        "cross_references": ["2 Corinthians 8:9", "John 17:5", "Hebrews 2:14"],
        "theological_notes": [
          "Divine Nature: Christ possessed the very nature of God.",
          "Self-Emptying: He veiled His glory and accepted human limitations.",
          "Servant Form: The Creator becomes a servant of His creation."
        ]
      }
    }
  },
  "Hebrews": {
    "9": {
      "22": {
        "commentary": "The principle that forgiveness requires bloodshed is established by divine law. Without the shedding of blood, there can be no remission of sins.",
        "cross_references": ["Leviticus 17:11", "1 Peter 1:19", "Revelation 1:5"],
        "theological_notes": [
          "Blood Requirement: Divine justice demands payment for sin.",
          "Substitutionary Principle: Innocent blood pays for guilty parties.",
          "Christ's Superior Sacrifice: His blood is infinitely superior to animal blood."
        ]
      }
    },
    "11": {
      "6": {
        "commentary": "Faith is the fundamental requirement for approaching God. True faith believes both in God's existence and His character as a rewarder of those who seek Him.",
        "cross_references": ["Romans 14:23", "James 1:6", "Jeremiah 29:13"],
        "theological_notes": [
          "Faith Necessity: Without faith, it's impossible to please God.",
          "Two Elements: Faith involves belief in God's existence and character.",
          "Divine Reward: God responds to those who diligently seek Him."
        ]
      }
    }
  },
  "Revelation": {
    "1": {
      "7": {
        "commentary": "Christ's second coming will be visible to all humanity. This verse combines Daniel 7:13 and Zechariah 12:10, showing the unity of prophetic Scripture.",
        "cross_references": ["Daniel 7:13", "Zechariah 12:10", "Matthew 24:30"],
        "theological_notes": [
          "Visible Return: Christ's second coming will be unmistakable.",
          "Universal Recognition: All will see and acknowledge Him.",
          "Mourning Response: Those who rejected Him will mourn at His appearing."
        ]
      }
    },
    "20": {
      "15": {
        "commentary": "The Great White Throne judgment determines eternal destiny based on whether one's name is written in the Book of Life, not on works recorded in other books.",
        "cross_references": ["Daniel 12:2", "John 5:29", "Philippians 4:3"],
        "theological_notes": [
          "Final Judgment: This is the last judgment before eternity begins.",
          "Book of Life: Only those whose names are recorded escape judgment.",
          "Works Evidence: Works reveal character but don't determine destiny."
        ]
      }
    }
  }
}